[
  {
    "mnemonic": "1. ab+stain...we tend to stay away from stain....\n2. this can be written as \"ab+stai......and stai......sounds like stay.... and .. stay out of something\n   means not involving in sth that doesn't concern to one.\n3. ab+stain ... Dell Steyn is a dangerous bowler .. batsman normaly dont want to cm in front of him\n4. Focus on stain mom will scold us if we have some ud or ink stains on our dress .So,promise to mom i\n   wont play in mud again(choose not to do something\")\n5. like in above case intentionally not using one's vote.means one knows that even if he/she uses thier\n   votes politicians will never change hence they are concern about it and staying out of the voting\n   process\n6. ab (away) + stain = Mom asked me to be away from or not participate in the party due to stain\n",
    "information": "Definition: Hold back, refrain (especially from something bad or unhealthy); decline to vote\n\nUsage: The church board voted on whether to hold an abstinence rally to encourage young people not \nto become sexually active; while most members voted in favor, one voted against and two abstained, \nwith one abstainer commenting that, as far as she knew, the church’s teens were pretty abstemious \nalready.\n\nRelated Words: Temperance (moderation, holding back), Teetotaler (a person who abstains from \nalcohol), Forbear (hold back or abstain from)\n\nMore Info: Abstain is usually followed by “from” (vegetarians forbear meat or abstain from meat).\n\n",
    "pronunciation": "ab-STAIN",
    "type": "(verb)",
    "name": "abstain"
  },
  {
    "mnemonic": "1. abhor sounds like \"a whore\" and we generally hate a whore....so to hate someone is abhoring that\n   person\n2. ab + hor (horror) -- that means we should always hate the horror.\n3. Abhor - The last part sounds like HORror ppl hate horror films, they detest them. i.e they dont test\n   them.\n4. a + bhor = a (one) + bhor (sunrise in hindi) so i hate to ger up early i hate to get up at bhor\n5. a + bhor (bore).. a bore person is always rejected. Many people generally abhor a bore person.\n6. abhor = \"ab\" (away) + \"hor\" (prostitute)\n",
    "information": "Definition: Detest, regard with disgust\n\nUsage: “Go out with you?” she replied. “I abhor you! I would rather stab myself with a rusty bread \nknife than be your girlfriend!”\n\nRelated Words: Loathe, Abominate (synonyms), Antipathy (instinctive repugnance or aversion)\n\nMore Info: The prefix “ab” means “away”—if you abhor (or abominate) something, you want to get \nas far away from it as possible.\n\n",
    "pronunciation": "ab-HORE",
    "type": "(verb)",
    "name": "abhor"
  },
  {
    "mnemonic": "1. a+bridge..well bridges are meant to reduce the gap between something..so abridging..something means\n   reducingor shortening something.\n2. a+bridge : bridges can shorten the transportation time..\n3. there was a long path but due building of bridge path was shorten\n4. ab-rid\n5. The Abridged Dictionary, Yey! not 100,000 words, just 3,000.\n",
    "information": "Definition: Reduce or lessen; shorten by omitting parts throughout while retaining the main idea\n\nUsage: Our romantic vacation was abridged when the babysitter called to say that the kids were sick \nand we should come home. / Audio books are almost always abridged, since few people want to \nlisten to a 200-hour book.\n\nRelated Words: Truncate (shorten by cutting off a part)\nMemory Trick: When you abridge a book, you cut out sections from all over (hopefully without being \ntoo obvious)—that is, you create a bridge from the last part you kept in to the next part you kept in, so \npeople don’t notice the missing bits. An abridged book still tells the whole story; a truncated book is \nmissing the ending!\n\n",
    "pronunciation": "uh-BRIDGE",
    "type": "(verb)",
    "name": "abridge"
  },
  {
    "mnemonic": "1. adverse = ad + verse (versus) versus means compilation/fight between two Opponents so, it is\n   something which shows OPPOSITION\n2. adverse ~ ad-worse, (adding worse) : something which is contrary to your interests or welfare can\n   only make your situation worse.\n3. SAD VERSE\n4. verse sounds like versa car- versa car is nt favourable to buy\n5. ADVERSE<===> à¤µà¤¿à¤ªà¤°à¥€à¤¤ (pr. \\\\viparit \\\\ )[Adjective]\n",
    "information": "Definition: Opposing, harmful\n\nUsage: Pioneer women persevered despite adverse circumstances, even when fording a river—baby \nin one arm, leading a horse with the other—against an adverse current.\n\nRelated Words: Antagonistic (hostile, acting in opposition)\n\nMore Info: Adverse appears in “adverse criticism,” although that expression is a bit redundant. \nAdverse is also related to adversary (an opponent, foe).\n\n",
    "pronunciation": "AD-verss",
    "type": "(adj)",
    "name": "adverse"
  },
  {
    "mnemonic": "1. advocate...advocate usually \"urges\"or \"pleads\" judge to give in his favour\n2. advocate: add+ur VOICE ...support\n3. Think of avocado.\n",
    "information": "Definition: Speak or argue in favor of (verb); a person who pleads for a cause or on behalf of \nanother person (noun)\n\nUsage: I cannot possibly vote for a candidate who advocates oil drilling in federally protected nature \npreserves. / Children often have advocates appointed to represent them in court.\n\nRelated Words: Proponents, Exponents, or Champions are all people who advocate for a cause.\n\nMore Info: Advocate contains the root “voc,” meaning “to call.” This root also appears in vocal, \ninvoke, etc.\n\n",
    "pronunciation": "AD-voh-kayt (v), AD-voh-kit (n)",
    "type": "(verb, noun)",
    "name": "advocate"
  },
  {
    "mnemonic": "1. Like acne=high points on skin(pimple).Acme=Highest point in ones work.\n2. in cartoon network the coyote uses ACME tools to kill the road runner.... jus remember he always\n   falls off the PEAK of a mountain.,, always\n3. A(aaaaaaaaaaaa......) C(see)\n4. Sounds like LAKME (face cream) whose products promise your beauty to reach its peak.\n5. Acme can be rearranged as Meca sound like Mecca Going to Mecca is the highest dream of Muslims\n6. Acme Sounds like peak me.\n",
    "information": "Definition: Summit, peak, highest point\n\nUsage: The acme of my vacation was when I finally climbed to the acme of the mountain and enjoyed \nthe gorgeous vista.\n\nRelated Words: Summit, Pinnacle (synonyms), Apex (vertex, tip, point), Apogee (high point, point at \nwhich the moon is furthest from the Earth)\n\nMore Info: Acme, Summit, Pinnacle, and Apex are all popular names for businesses: Apex \nLocksmith, Pinnacle Home Security, etc. (Acme is especially popular, since it occurs early in the \nphone book).\n\n",
    "pronunciation": "ACK-mee",
    "type": "(noun)",
    "name": "acme"
  },
  {
    "mnemonic": "1. rebate means discount... i.e reducing the price..\n2. (Tag : ) abate which is rhyming with debate.Debate means raising(actually in discussion imagine that\n   in every thing) just opposite to debate consider abate that is reduction in nature\n3. ab ate mat karo abate your weight\n4. A BAIT is given to rats at home finally rats get reduced. So u can directly give ABATE to rat to\n   reduce its population i.e; ABATE is reducing\n5. 'abate' sounds like the hindi bait\" means \"come sit\". Imagine a tired old man visiting you and you\n   offer a chair and say 'aa bait' it will lessen relieve your tiredness.\n6. ABATE=AB+ATE... here \"ATE\" is the past tense of \"eat\". So when we eat, the quantity tends to reduce\n   or lessen... the same applies here..\n",
    "information": "Definition: Reduce, diminish\n\nUsage: Her stress over spending so much money on a house abated when the real estate broker told \nher about the property’s 15 year tax abatement.\n\nRelated Words: Tax abatement is used in the same way as tax “relief”—that is, a partial discount. \nSubside is another word for lessening (a storm could abate or subside).\n\nMore Info: Abate comes from an Old French word for “beat, cast down” that also gives us batter \n(beat severely) and abattoir (slaughterhouse).\n\n",
    "pronunciation": "uh-BAYT",
    "type": "(verb)",
    "name": "abate"
  },
  {
    "mnemonic": "1. ab+dicate\n2. ab(à¤…à¤¬ ) di (à¤¦à¥€ ) CAT which means in Hindi \"now given up the cat\", imagine you have a\n   powerful cat and you given her to some one.\n3. ab (root ab means away as in abandon) + dic (dictatorship) + ate (to eat and hence reduce) : means\n   to give away (or reduce) dictatorship and hence to give-up power.\n4. \"Ab nai dictate\" means now u hav to giv up.\n5. ab-di-ca-de\n6. Lord Ram abdicated his kingdom for Bharath\n",
    "information": "Definition: Formally give up the throne (or some other power or responsibility)\n\nUsage: King Edward VIII of England famously abdicated the throne in order to marry an American \ndivorcée. / Parents can be charged with neglect for abdicating their responsibilities towards their \nchildren.\n\nRelated Words: Don’t confuse abdicate with dethrone and depose, which refer to forcing a leader \nfrom power. Abdication is voluntary.\n\nMore Info: Abdicate comes from the root “ab” (away) and “dic/dict” (proclaim), the latter of which \nalso appears in dictator, dictionary, dictate, dictum, and indict.\n\n",
    "pronunciation": "AB-di-cayt",
    "type": "(verb)",
    "name": "abdicate"
  },
  {
    "mnemonic": "1. (Tag: Global) ab (away) + err (error) + ant : focus on ERR and ANT. Ants normally move together in a\n   queue. imagine all these ants moving randomly like a group of honey bees. That would be abnormal\n   behaviour.\n2. (beer+ant)...ant drank beer and walking abnormal..\n3. ab (away) + err (error) + ant : focus on ERR and ANT, usually an ant follows a path ... so moving\n   away from (root ab means away from) that path means, error in regular path and hence deviating from\n   normal path...or behaviour\n4. aberrant behaviour of owner abb agar rent nahi diya\n5. ab error aa gayi..hence it is no more normal...hence abnormal\n6. Ab-Abishek bachan, Ran-ran at the back of,Ant- Aunty. total is \"abishek inspite of having Ash he was\n   running at the back of auntys. it means he is mentally ABNORMAL\"\n",
    "information": "Definition: Abnormal, deviant\n\nUsage: The teen’s aberrant behavior made his family suspect that he was using drugs. / Losing rather \nthan gaining weight over the holidays is certainly an aberration.\n\nRelated Words: Anomaly (deviation from the norm, inconsistency), Outlier (a person on the fringe; a \ndata point that lies outside the main pattern of data)\n\nMore Info: The prefix “ab” means “away”—in this case, away from what’s normal.\n\n",
    "pronunciation": "AB-er-int",
    "type": "(adj)",
    "name": "aberrant"
  },
  {
    "mnemonic": "1. 'affection' is natural and true, but\n",
    "information": "Definition: Fake behavior (such as in speech or dress) adopted to give a certain impression\n\nUsage: I’m annoyed whenever Americans move to England and suddenly start speaking with an \naffected British accent; such affectations, when practiced by celebrities, are only likely to alienate \ntheir fans.\n\nRelated Words: Artifice (trickery, especially as part of a strategy)\n\nMore Info: In slang, some people call affected behavior “being a poser” (or poseur).\n\n",
    "pronunciation": "aff-eck-TAY-shun",
    "type": "(noun)",
    "name": "affectation"
  },
  {
    "mnemonic": "1. in the add of \"eak choti si love story\" monisha koiralla on orkut and she shall admonish u/warn u\n   for doing so\n2. adm(in)+on(e)+(pun)ish : (net)admin in the company is one step away (Giving strong warning now) from\n   punishing you.bcoz you are accessing prohibited network sites.\n3. to avoid A DEMON-ish act, a mother Warns her naughty child\n4. Admonish--->Ad(Advertisement)+Monish(person's name)--Direct Monish was warned by Censored board for\n   making Uncensored Advertisement.\n5. admonish ~ ADD MANISH -- Add Manish in the list of guys whom we will WARN to stay away from her.\n6. Admonish spounds similar to Admission Before giving addmission into bar guards admonish (warn)youth\n",
    "information": "Definition: Mildly scold; caution, advise, or remind to do something\n\nUsage: She was an exacting boss who upbraided an employee for jamming the copier, yet she merely \nadmonished her five-year-old for the same offense.\n\nRelated Words: Reprove, upbraid, reprimand, and rebuke are all harsher forms of criticism than \nadmonish.\n\nMore Info: You can also admonish someone to do something, as in “The GRE instructor admonished \nher students to study vocabulary every day.”\n\n",
    "pronunciation": "ad-MAHN-ish",
    "type": "(verb)",
    "name": "admonish"
  },
  {
    "mnemonic": "1. Abjure think it like injure. so once you are injured you will give up.\n2. ab+jure...jure- jor (in Hindi) Jor lagaao chodoo mat....(Don't Give up) (this mnemonic is in Hindi\n   Language)\n3. abjure ~ ab (away) + jure (jury). He abjured (rejected, moved away from) her earlier statements in\n   front of jury.\n4. ab jury ke saamne kasam khaata hoon, i'll not do this again\n5. ab+jaanede+yaar (abjure) am renouncing\n6. ABJURE = the prefix AB- means against. -JURE means rule (like JURY)\n",
    "information": "Definition: Give up, renounce; repudiate, recant, or shun (especially formally or under oath)\n\nUsage: To become a citizen of the United States, you must abjure loyalty to the nation of \nyour birth. / Since enrolling in that nutrition class, she has abjured sugar and saturated fats.\n\nRelated Words: Forswear (reject or renounce under oath; swear falsely in court), Eschew \n(shun, avoid, abstain from)\n\nMore Info: Abjure can be used in the same way as renounce. You renounce worldly \npleasures, a religion or family member, membership in a group, etc. It can also be used in \nthe same way as repudiate, which is more often used with ideas, as in “Galileo repudiated \nthe belief that the Sun revolves around the Earth.”\n\n",
    "pronunciation": "ab-JOOR",
    "type": "(verb)",
    "name": "abjure"
  },
  {
    "mnemonic": "1. abrasive:ab-Erasive:which means rubbing away\n2. abrasive..it sounds like aggressive,which means harsh behavior\n3. A+BRA+sive.. it is very harsh behaviour if we touches a womens bra.. which is not good..\n4. ab + rasi -- ab means away and rasi sounds like erase.. erasing something to remove away some dirt..\n   hence rubbing away.\n5. take first three letters of this word...i.e. ABR...\n6. a-bra-sive which is rubbed every day\n",
    "information": "Definition: Rough, suitable for grinding or polishing (such as sandpaper); causing irritation or \nannoyance\n\nUsage: Could the inside of this mascot costume be any more abrasive? It’s rubbing my skin raw! I \nhave some seriously abrasive remarks for whoever designed this thing.\n\nRelated Words: Caustic (capable of burning or corroding; extremely critical or sarcastic), Excoriate \n(to rub the skin off of; to criticize very harshly)\n\nMore Info: Like caustic and excoriate, abrasive can be used literally or metaphorically. You scrub a \ndirty pan with something abrasive, such as steel wool. Harsh criticism is abrasive, like being \nscrubbed with steel wool.\n\n",
    "pronunciation": "uh-BRAY-siv",
    "type": "(adj)",
    "name": "abrasive"
  },
  {
    "mnemonic": "1. affection+able=affection to others\n2. affable= f + able, => that the teacher is able to give f grade to the students , so students are\n   always trying to maintain a warm n healthy relation with the teachers, n also students always\n   approaches their teachers.\n3. Someone who is affable is laughable!\n4. aff+able\n5. aff-able,relate aff to affectionate.. its always easy to talk to an affectionate person who will\n   obviously be friendly\n6. sounds like affection that means kind=love=affable\n",
    "information": "Definition: Warm and friendly, pleasant, approachable\n\nUsage: The professional wrestler played at belligerence in the ring, but in real life, he was quite an \naffable fellow—sociable, easy-going, and always ready to lend a hand.\n\nRelated Words: Amiable, Cordial, and Genial are synonyms.\n\nMore Info: The opposite of affable could be standoffish, discourteous, or distant.\n\n",
    "pronunciation": "AFF-uh-bull",
    "type": "(adj)",
    "name": "affable"
  },
  {
    "mnemonic": "1. Adhere is relating to a adhessive which is used to stick or join two materials.......so the meaning\n2. adhere ~ add + here; so adding tow things together means to stick them.\n3. ad(add) here , its pronouncing like an order ,,,,,come on add fast (stick fast )\n4. ADHERE<===> à¤ªà¤¾à¤²à¤¨ à¤•à¤°à¤¨à¤¾ (pr. \\\\palan karana \\\\ )[Verb]\n",
    "information": "Definition: Stick (to), such as with glue, or to a plan or belief\n\nUsage: I have a message board that adheres to my refrigerator with magnets; on it, I’ve written some \naffirmations to help me adhere to my diet plan.\n\nRelated Words: Abide by (follow, conform to), Cohere (become united, hold together as part of the \nsame mass)\n\nMore Info: Use adhere for attaching two different kinds of things together, and cohere for things of \nthe same kind (good cookie dough coheres instead of crumbles).\n\n",
    "pronunciation": "ad-HERE",
    "type": "(verb)",
    "name": "adhere"
  },
  {
    "mnemonic": "",
    "information": "Definition: The practice of pursuing political or other goals through vigorous action, often including \nprotests and demonstrations\n\nUsage: Lindsay’s parents had a hard time accepting that, after incurring $100,000 in student loans, \ntheir daughter had decided to enter the low-paying field of environmental activism.\n\nRelated Words: Advocacy (pleading for, recommending), Champion (one who defends or supports, as\na cause)\n\nMore Info: Activism is often considered noble, but judicial activism—going beyond interpreting \nexisting laws to actually using court decisions to create new public policies—is often controversial.\n\n",
    "pronunciation": "ACK-ti-vizm",
    "type": "(noun)",
    "name": "activism"
  },
  {
    "mnemonic": "1. aes + thetic\n2. aes sounds like ash-aishvarya.so,everyone appreciates the beauty of aishvarya.\n3. Sounds like \"anesthesia,\" which makes you loopy, thinking everything around you is beautiful...\n4. AESTHETIC<===> à¤¸à¥Œà¤‚à¤¦à¤°à¥à¤¯à¤ªà¥à¤°à¥‡à¤®à¥€ (pr. \\\\saunadaryapremi \\\\ )[Adjective]\n5. aesthetic ~ aastha (faith or belief); You have aastha in aesthetic things (person or object)\n6. aesthetic - the sea is beautiful.\n",
    "information": "Definition: Concerning the appreciation of beauty or good taste, pertaining to the science of what is \nbeautiful (adj); a sense of beauty and taste of a particular time and place (noun)\n\nUsage: The twins were so different—one possessed a truly baroque aesthetic, preferring golden, \ngilded decor. The other lived in a world of pure logic, untouched by any aesthetic sense whatsoever; \nart did not move him, his house was bare, and he married his wife solely because she was a master of \ncalculus.\n\nMore Info: The meaning of aesthetic can range from the academic study of beauty (aesthetics) to \nperforming manicures, the work of an aesthetician. Don’t confuse aesthetic with ascetic (pertaining \nto a simple, austere life with no luxuries, such as that of a monk; a person who leads such a life).\n\n",
    "pronunciation": "ess-THEH-tick",
    "type": "(adj, noun)",
    "name": "aesthetic"
  }
]