[
  {
    "mnemonic": "1. aerie = like 'airy' =>high altitude\n",
    "information": "Definition: Dwelling or fortress built on a high place; the nest of a bird of prey, such as an eagle or \nhawk, built on a mountain or cliff\n\nUsage: The billionaire smoked a cigar out his window and watched the riots in the streets below, safe \nin the aerie of his penthouse apartment.\n\nRelated Words: Stronghold (a well fortified place, especially the central place of a controversial \ngroup, as in “Police raided the smugglers’ stronghold.”)\n\nMore Info: Aerie may also be spelled aery, eyrie, or eyry. It shares an origin with “airy,” coming \nfrom a Latin word pertaining to an open field.\n\n",
    "pronunciation": "AIR-ee or EYE-ree",
    "type": "noun",
    "name": "aerie"
  },
  {
    "mnemonic": "1. Accretion\n2. ACCRETION sounds like secretion which gives an idea of growth in size.\n3. accretion ~ add + creation , this\n4. Ac-creation\n5. University gets accreditation as it grows and improves\n6. Ac-creation\n",
    "information": "Definition: Gradual increase; an added part or addition\n\nUsage: He was pleased by the accretion of money in his portfolio. / Some charitable funds keep the \nprincipal in their accounts untouched and use only the accretion for philanthropic purposes.\n\nRelated Words: Augment (grow larger), Agglomerate (form into a mass or cluster, join together)\n\nMore Info: Bank accounts accrue interest. Good deeds, ideally, accrue rewards.\n\n",
    "pronunciation": "uh-CREE-shun",
    "type": "noun",
    "name": "accretion"
  },
  {
    "mnemonic": "1. suppose you are shy girl and you have a+ male+game+mate (amalgamate)what you should do ? of course\n   combine or unite with your mate against other groups\n2. amalga+mate ,mate means combine........\n3. amalgamate: as we all know that AMALGAM is the alloy of mercury.and alloy means MIXING things\n   together.SO AMALGAMATE means mixing or combining.\n4. remeber pomegranate in which the seeds are united together into one combined ball.\n5. There is a game at a mall. Hence people come together...Gather for the game!\n6. amalgamate -amass means to collect\n",
    "information": "Definition: Blend, merge, or unite\n\nUsage: The Amalgamated Transit Union is so called because it contains many local unions of bus \noperators, subway operators, baggage handlers, etc. / When turning her life story into a memoir, she \namalgamated two important relatives into a single character, even amalgamating their names (Mary \nand Rose) into the character “Aunt Mary Rose.”\n\nRelated Words: Agglomerate (collect into a mass), Aggregate (gather together), Commix (mix \ntogether), Conglomerate (anything made up of different kinds of materials; blended; to bring \ntogether), Consolidate (unite or combine, such as companies or debts)\n\n",
    "pronunciation": "uh-MAL-guh-mayt",
    "type": "verb",
    "name": "amalgamate"
  },
  {
    "mnemonic": "1. acumen sounds like IQ-men.. men with high IQ have ability to judge quickly (has keen insight).\n2. ACUTE+MIND...acute means sharp\n3. acumen sounds like \"IQ-man\" or \"a quick man\" which grasps quickly\n4. acu+men its sounding like active men. Active men have an ability to think and judge quickly\n5. acute of men-->ability to understand and judge any men quickly Ex:Business ACUMEN\n6. Acumen could be seen as ACCURATE - MEN\n",
    "information": "Definition: Keen, quick, accurate insight or judgment\n\nUsage: His political acumen allowed him to bargain behind the scenes and get bills passed despite \nbeing in the minority party.\n\nRelated Words: Perspicacity (acuteness of perception)\n\nMore Info: Acumen comes from a Latin word for “needle”—hence the idea of being mentally \n“sharp.”\n\n",
    "pronunciation": "ACK-yoo-men",
    "type": "noun",
    "name": "acumen"
  },
  {
    "mnemonic": "1. aloof:aloo(potato)+f..u like aloo so mom keeps it \"apart\" for u..it is \"reserved\" for u\n2. Aloof (ALOne in the rOOF), when some is alone in the roof, he is at distance from other members of\n   house.\n3. aloof~ a roof; Alone on roof top !!\n4. aloof- imagine you cant call anyone you are lone and apart so first while you call someone you say\n   \"alo\" no answer so you say \"of\" nobody answering you are apart and reserved - alo+of\n5. consider aloof is pronounced as a+lu...we always keep lu area apart from the home so that it will\n   not create any problem in daily life\n6. ALOOF = ALO + OF; ALOO OF STORE IS ALWAYS STORED IN COLD STORE.\n",
    "information": "Definition: Distant physically or emotionally; reserved; indifferent\n\nUsage: Perceiving her parents as cold and aloof, the child was naturally drawn to her warm, genial \naunt.\n\nRelated Words: Detached (impartial or aloof), Standoffish (cold, unfriendly)\n\nMore Info: A common stereotype is that dogs are affable, while cats are aloof.\n\n",
    "pronunciation": "uh-LOOF",
    "type": "adj",
    "name": "aloof"
  },
  {
    "mnemonic": "1. A+bys....(this mnemonic is in hindi...ek 20(bees) feet ka gadda)..i.e. Vast bottomless pit....\n2. ab+y+ss--- ab ss, sounds ab hissssss, remember movie HISSS of malika in which she is a snake, snake\n   lives in DEEP HOLE\n3. a + bys (take dis as 20 i.e. bees in hindi language)+mal(take it as mile)..... so a 20 mile deep pit\n   in the ground looks like its bottomless.\n4. <B>abyss</B> sounds similar to abuse. When you're seriously abused, you become depressed and feel\n   like jumping into <B>abyss</B>\n5. its like a hindi word \"vis\"means poison by which man reach till pit\n",
    "information": "Definition: A deep and vast space or cavity; anything profound or infinite\n\nUsage: Walking a tightrope over an active volcano, the acrobat was terrified of falling into the abyss. \n/ Now recovering, the patient remembered her experience with clinical depression as an abyss of \nhopelessness.\n\nRelated Words: Chasm, Crevasse, Fissure, Gorge are all words for deep openings in the earth, and \ncan be used metaphorically (a fissure in a personal relationship, the chasm between cultures, etc.).\n\nMore Info: The 1989 classic science fiction movie The Abyss is about a diving team that encounters \nan underwater alien species.\n\n",
    "pronunciation": "uh-BISS",
    "type": "noun",
    "name": "abyss"
  }
]