[
  {
    "mnemonic": "1. A dumb brat can't give the details - just a sketchy outline.\n2. umbra means shadow, ad+umbra means to shadow the details, so the word means outline, to shadow,\n   obscure and overshadow.\n3. A+DUMB+REPRESENTATION=ADUMBRATION...imagine a dumb is giving you a representation...how will he do\n   it???....represent in outline,indicate faintly...\n4. A dumb rate is always vague.\n",
    "information": "Definition: Give a rough outline of; foreshadow; reveal only partially; obscure\n\nUsage: When I took on the lead role in the movie, I agreed not to give away the plot, but I suppose I \ncould give a brief adumbration of the premise.\n\nMore Info: Adumbrate contains the root “umbra,” Latin for “shadow.” It may seem that “give an \noutline of” and “obscure” are opposites, but think of it this way—to adumbrate is to give a shadowy, \nvague picture of something, which could mean giving more information (if starting with nothing) or \nobscuring information (if starting with a clear picture) in order to reach that point.\n\n",
    "pronunciation": "AD-um-brayt or uh-DUM-brayt",
    "type": "verb",
    "name": "adumbrate"
  },
  {
    "mnemonic": "1. It's not vulgar but a fact....how are breasts????....alongside each other and facing the same\n   direction....\n",
    "information": "Definition: Side-by-side. The more common “abreast of” means keeping up with, staying aware of, \nor remaining equal in progress with.\n\nUsage: As the professor walked abreast down the street with her mentor, she was amazed that the old \nman, long since retired, still kept abreast of all the latest developments in neurobiology.\n\nRelated Words: Conversant with (familiar by use or study), well versed in (experienced, skilled)\n\nMore Info: You are conversant with a topic about which you know enough to have an intelligent \nconversation. Well versed is stronger, implying some expertise. Keeping abreast of a topic implies \nthat you are continually updating your knowledge.\n\n",
    "pronunciation": "uh-BREST",
    "type": "adj",
    "name": "abreast"
  },
  {
    "mnemonic": "1. ACID..(USUALLY SOUR AND BITTER IN TASTE)...so anything which include acid will automatically give\n   you sour and bitter taste\n2. acid-acidic , lous>tast so acidic tast\n3. acid+less, so slightly bitter or slightly sour\n4. Acidulous - Acid - rescramble ous to sou+r = sour. Acid sour.\n",
    "information": "Definition: Slightly acid or sour; sharp or caustic\n\nUsage: Grapefruit juice is acidulous. / I’m skipping Thanksgiving this year just to avoid my mother’s \nacidulous comments about what she thinks I ought to be doing with my life.\n\nRelated Words: Acerbic (sour, harsh or severe)\n\nMore Info: In Latin, “acidus” meant sour, so “acidulus,” a diminutive version, meant “slightly sour.”\n\n",
    "pronunciation": "uh-SID-joo-luss",
    "type": "adj",
    "name": "acidulous"
  },
  {
    "mnemonic": "",
    "information": "Definition: Although, even though\n\nUsage: The village leader was illiterate albeit highly intelligent. / The trip was exciting, albeit brief.\n\nRelated Words: Notwithstanding (in spite of, although, all the same—“Notwithstanding the video of \nhis crime, he was acquitted on a technicality”)\n\nMore Info: Albeit is a shortening of “although it be.”\n\n",
    "pronunciation": "al-BEE-it",
    "type": "conjunction",
    "name": "albeit"
  },
  {
    "mnemonic": "1. in the word accede acce sounds like\"axe\"- when you have \"axe\" scent girls will agree to what u said\n2. startng letters soundd lyk axe(acce)+de...usually when u happen 2 experience a threat wid an axe,u\n   agree 2 everythng othrs want...so basically accede goes 2 agreement...\n3. people accept anything u say when u carry acid in ur hand\n4. ac+cede( means to yield)..so accede means to yield to somebody opinion or wish.\n5. sounds like accept + agreed : accede;\n6. ACCEDE = ACCEPT\n",
    "information": "Definition: Agree, give consent; assume power (usually as “accede to”)\n\nUsage: While the Englishman was a strong believer in democracy, he had to accede that watching \nPrince Charles someday accede to the throne would indeed be exciting.\n\nRelated Words: Assent also means agree or give in.\n\nMore Info: When Prince Charles accedes to the throne, he will be succeeding (taking power after) \nQueen Elizabeth.\n\n",
    "pronunciation": "ack-SEED",
    "type": "verb",
    "name": "accede"
  },
  {
    "mnemonic": "1. Abscond – ab + scond. ‘Absent in a second’. When you will absent in a second? =when u STEAL OFF &\n   HIDE, or when u DEPART secretly.\n2. absCOND sounds like abs'KAND'..when you do KAND you run away, depart secretly and hide :)\n3. focus on cond=condition if elders keep conditions to do this n that we will do it secretly or we\n   will escape from that place secretly\n4. ABSENT KAUN(who?) - whoever is absent in class has absconded\n5. abscond treat it like james bond, hidinng from villain\n6. ab-Abishek, scond-scoundral \"Amithab scolded Abi as scoundral, and abishek ran off or hide secretly\n   with fear\n",
    "information": "Definition: Depart suddenly and secretively\n\nUsage: A robber absconds with stolen goods. People who eat in a restaurant and run out without \npaying—or criminals who jump bail—could also be said to be absconding.\n\nRelated Words: Decamp (to depart from camp, or to abscond)\n\nMore Info: “Ab” means “away” and the rest of abscond comes from a Latin word meaning “to put.”\n\n",
    "pronunciation": "ab-SCOND",
    "type": "verb",
    "name": "abscond"
  },
  {
    "mnemonic": "1. Sounds like \"Acidic.\" Lemons have a sour taste and are acidic. Therefore, they are ACERBIC.\n2. I got to hear acerbic rebuke from my big bro when his ACER laptop fell from my BIKe !\n3. I think Arabic which sounds harsh to me\n4. Azher(cricket player) using harsh language on a BIcni girl\n",
    "information": "Definition: Sour; harsh or severe\n\nUsage: Lemons are acerbic. Harsh comments are also acerbic, like putting lemon juice on a wound.\n\nRelated Words: Caustic (capable of burning or corroding; extremely critical or sarcastic), Acrid \n(sharp or biting, pungent), Astringent (biting, severe; a skin cleaning fluid that clears pores)\n\nMore Info: An acerbic taste is sour and an acrid taste is unpleasantly bitter, but when used \nmetaphorically, both words mean harsh, critical.\n\n",
    "pronunciation": "uh-SER-bick",
    "type": "adj",
    "name": "acerbic"
  },
  {
    "mnemonic": "1. It had the word sciss(scissors) in it.Scissors are used for Cutting,seperating..\n2. ab + scission = scissor scissor separates two things by cutting them ,so separation\n3. \"abscission\" sounds like \"Recession\"..nw a days companies are cutting their employs due to\n   recession.\n4. its from word abscissnic acid which causes cutting of bud off the plant. so abscission is cutting\n   off\n5. rogate is something that sounds rogam which should b abolished......\n6. Imagin word in following way \"absc I ssion\". Here \" I \" is separating\n",
    "information": "Definition: Cutting off; sudden termination; the separation of leaves, petals, or other parts from a \nplant or animal\n\nUsage: The abscission of leaves from the trees is normal in fall. / An inflamed appendix calls for an \nimmediate surgical abscission.\n\nRelated Words: Ablation (removal of growths, etc., by surgery or other mechanical means)\n\nMore Info: “Ab” means “away.” The “scissio” root in abscission means “cut” and is the same as in \nscissors, excise (cut out or censor), and incision (cut into).\n\n",
    "pronunciation": "ab-SIZZ-zhun",
    "type": "noun",
    "name": "abscission"
  },
  {
    "mnemonic": "1. abase-abe(a slang used to degrade acvv person)+shhh(se)usually an attempt to degrade a person's\n   opinion..ovral goes to humiliate a person....\n2. Abase > to bring someone down back to A BASE level.\n3. a= no, negative, less & base = base, position, grade.. combinedly lessen the position/grade\n4. A baseball player tripped over A BASE marker thus humiliating himself.\n5. abase = a + base; without a base; Imagine you shifted to a new house whose base is not very strong\n   (without base) and hence it may fall down anytime and can abase you in front of your neighbours.\n6. abase=BASEti karna(beizzzati)\n",
    "information": "Definition: Degrade or humble; to lower in rank, status, or esteem\n\nUsage: After messing up at work, the man faced a thorough abasement from his boss; when he \nrealized he had forgotten his own wedding anniversary, he further abased himself in front of his wife.\n\nRelated Words: Defame (attack the reputation of), Belittle (put down, disparage)\nMemory Trick: Abasement means degradation or lowering of status—that is, abasement makes you \nfeel like you should go hide in a basement.\n\n",
    "pronunciation": "uh-BASE",
    "type": "verb",
    "name": "abase"
  },
  {
    "mnemonic": "1. dull+the+rate = impure, means to decrease the rate\n2. Adults are more impure than children, so adulterate means to make impure\n3. when a child becomes adult he loses his purity and innocence...so any thing adulterated is\n   contaminated or has lost its purity.\n4. Think adulterate which reduces purity in marriage\n5. ADULTERATE<===> à¤®à¤¿à¤²à¤¾à¤µà¤Ÿ à¤•à¤° (pr. \\\\milavaT kar \\\\ )[Verb]\n6. Adulterate: Add alternatives instead of original\n",
    "information": "Definition: Make impure by adding inappropriate or inferior ingredients\n\nUsage: Some bars adulterate top-shelf liquor by pouring cheaper brands into the more expensive \nbrands’ bottles.\n\nRelated Words: Taint (contaminate, corrupt), Debase (reduce in quality or dignity)\n\nMore Info: Adulterate is indeed related to adultery (cheating on one’s spouse)—both come from a \nLatin word meaning “to defile.”\n\n",
    "pronunciation": "uh-DULL-ter-ayt",
    "type": "verb",
    "name": "adulterate"
  },
  {
    "mnemonic": "1. a+beyance .. here concentrate on beyance.. it sounds like buoyancy which which suspends objects\n   above the ground level..\n2. remember \"abey\" in hindi... abey mat karo... do it later!\n3. Interpret it as opposite of obey+ance -- not obeying the given orders and suspend the work (action)\n4. Interpret it as opposite of obey+ance -- not obeying. Not obeying the orders of his Commanding\n   officer resulted in the captain's suspension for 13 days.\n5. ABHAYAS(practice) - due to lack of practice, main event got delayed.\n6. if you will not OBEY you will get suspended\n",
    "information": "Definition: Temporary suspension, inactivity\n\nUsage: The baseball player’s contract negotiations are in abeyance while doctors try to determine \nwhether his injuries will heal in time for the season.\n\nRelated Words: Hiatus (break or gap in an activity), Dormant (inactive, resting), Deferment or \nDeferral (postponement)\n\nMore Info: Abeyance generally occurs in the expression “in abeyance.” Real estate is in abeyance \nwhen no one owns it or the owner is unknown.\n\n",
    "pronunciation": "uh-BAY-enss",
    "type": "noun",
    "name": "abeyance"
  },
  {
    "mnemonic": "1. aerie = like 'airy' =>high altitude\n",
    "information": "Definition: Dwelling or fortress built on a high place; the nest of a bird of prey, such as an eagle or \nhawk, built on a mountain or cliff\n\nUsage: The billionaire smoked a cigar out his window and watched the riots in the streets below, safe \nin the aerie of his penthouse apartment.\n\nRelated Words: Stronghold (a well fortified place, especially the central place of a controversial \ngroup, as in “Police raided the smugglers’ stronghold.”)\n\nMore Info: Aerie may also be spelled aery, eyrie, or eyry. It shares an origin with “airy,” coming \nfrom a Latin word pertaining to an open field.\n\n",
    "pronunciation": "AIR-ee or EYE-ree",
    "type": "noun",
    "name": "aerie"
  },
  {
    "mnemonic": "1. Accretion\n2. ACCRETION sounds like secretion which gives an idea of growth in size.\n3. accretion ~ add + creation , this\n4. Ac-creation\n5. University gets accreditation as it grows and improves\n6. Ac-creation\n",
    "information": "Definition: Gradual increase; an added part or addition\n\nUsage: He was pleased by the accretion of money in his portfolio. / Some charitable funds keep the \nprincipal in their accounts untouched and use only the accretion for philanthropic purposes.\n\nRelated Words: Augment (grow larger), Agglomerate (form into a mass or cluster, join together)\n\nMore Info: Bank accounts accrue interest. Good deeds, ideally, accrue rewards.\n\n",
    "pronunciation": "uh-CREE-shun",
    "type": "noun",
    "name": "accretion"
  },
  {
    "mnemonic": "1. suppose you are shy girl and you have a+ male+game+mate (amalgamate)what you should do ? of course\n   combine or unite with your mate against other groups\n2. amalga+mate ,mate means combine........\n3. amalgamate: as we all know that AMALGAM is the alloy of mercury.and alloy means MIXING things\n   together.SO AMALGAMATE means mixing or combining.\n4. remeber pomegranate in which the seeds are united together into one combined ball.\n5. There is a game at a mall. Hence people come together...Gather for the game!\n6. amalgamate -amass means to collect\n",
    "information": "Definition: Blend, merge, or unite\n\nUsage: The Amalgamated Transit Union is so called because it contains many local unions of bus \noperators, subway operators, baggage handlers, etc. / When turning her life story into a memoir, she \namalgamated two important relatives into a single character, even amalgamating their names (Mary \nand Rose) into the character “Aunt Mary Rose.”\n\nRelated Words: Agglomerate (collect into a mass), Aggregate (gather together), Commix (mix \ntogether), Conglomerate (anything made up of different kinds of materials; blended; to bring \ntogether), Consolidate (unite or combine, such as companies or debts)\n\n",
    "pronunciation": "uh-MAL-guh-mayt",
    "type": "verb",
    "name": "amalgamate"
  },
  {
    "mnemonic": "1. acumen sounds like IQ-men.. men with high IQ have ability to judge quickly (has keen insight).\n2. ACUTE+MIND...acute means sharp\n3. acumen sounds like \"IQ-man\" or \"a quick man\" which grasps quickly\n4. acu+men its sounding like active men. Active men have an ability to think and judge quickly\n5. acute of men-->ability to understand and judge any men quickly Ex:Business ACUMEN\n6. Acumen could be seen as ACCURATE - MEN\n",
    "information": "Definition: Keen, quick, accurate insight or judgment\n\nUsage: His political acumen allowed him to bargain behind the scenes and get bills passed despite \nbeing in the minority party.\n\nRelated Words: Perspicacity (acuteness of perception)\n\nMore Info: Acumen comes from a Latin word for “needle”—hence the idea of being mentally \n“sharp.”\n\n",
    "pronunciation": "ACK-yoo-men",
    "type": "noun",
    "name": "acumen"
  },
  {
    "mnemonic": "1. aloof:aloo(potato)+f..u like aloo so mom keeps it \"apart\" for u..it is \"reserved\" for u\n2. Aloof (ALOne in the rOOF), when some is alone in the roof, he is at distance from other members of\n   house.\n3. aloof~ a roof; Alone on roof top !!\n4. aloof- imagine you cant call anyone you are lone and apart so first while you call someone you say\n   \"alo\" no answer so you say \"of\" nobody answering you are apart and reserved - alo+of\n5. consider aloof is pronounced as a+lu...we always keep lu area apart from the home so that it will\n   not create any problem in daily life\n6. ALOOF = ALO + OF; ALOO OF STORE IS ALWAYS STORED IN COLD STORE.\n",
    "information": "Definition: Distant physically or emotionally; reserved; indifferent\n\nUsage: Perceiving her parents as cold and aloof, the child was naturally drawn to her warm, genial \naunt.\n\nRelated Words: Detached (impartial or aloof), Standoffish (cold, unfriendly)\n\nMore Info: A common stereotype is that dogs are affable, while cats are aloof.\n\n",
    "pronunciation": "uh-LOOF",
    "type": "adj",
    "name": "aloof"
  },
  {
    "mnemonic": "1. A+bys....(this mnemonic is in hindi...ek 20(bees) feet ka gadda)..i.e. Vast bottomless pit....\n2. ab+y+ss--- ab ss, sounds ab hissssss, remember movie HISSS of malika in which she is a snake, snake\n   lives in DEEP HOLE\n3. a + bys (take dis as 20 i.e. bees in hindi language)+mal(take it as mile)..... so a 20 mile deep pit\n   in the ground looks like its bottomless.\n4. <B>abyss</B> sounds similar to abuse. When you're seriously abused, you become depressed and feel\n   like jumping into <B>abyss</B>\n5. its like a hindi word \"vis\"means poison by which man reach till pit\n",
    "information": "Definition: A deep and vast space or cavity; anything profound or infinite\n\nUsage: Walking a tightrope over an active volcano, the acrobat was terrified of falling into the abyss. \n/ Now recovering, the patient remembered her experience with clinical depression as an abyss of \nhopelessness.\n\nRelated Words: Chasm, Crevasse, Fissure, Gorge are all words for deep openings in the earth, and \ncan be used metaphorically (a fissure in a personal relationship, the chasm between cultures, etc.).\n\nMore Info: The 1989 classic science fiction movie The Abyss is about a diving team that encounters \nan underwater alien species.\n\n",
    "pronunciation": "uh-BISS",
    "type": "noun",
    "name": "abyss"
  }
]